# ===========================================
# Brewfile - Dotfiles dependencies
# ===========================================
# Install:  brew bundle
# Check:    brew bundle check
# Clean:    brew bundle cleanup
# Update:   brew bundle dump --force --file=Brewfile
# ===========================================

# -----------------
# Taps
# -----------------
tap "coursier/formulas"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "anomalyco/tap" # OpenCode CLI (opencode.nvim)
# Note: homebrew/cask-fonts est déprécié, les fonts sont maintenant dans le repo principal

# -----------------
# CLI Tools - Essential
# -----------------
brew "git"
brew "git-lfs"
brew "zsh"
brew "neovim"
brew "tree-sitter" # required by nvim-treesitter (main) to install parsers
brew "tree-sitter-cli" # required by nvim-treesitter (main) to compile parsers
brew "tmux"
brew "fzf"
brew "bat"
brew "eza"
brew "zoxide"
brew "fd"
brew "ripgrep"
brew "gh"
brew "lazygit"
brew "starship"
brew "diff-so-fancy"
brew "git-flow-avh"
brew "gnu-tar"
brew "pigz"
brew "sesh"
brew "nvm"
brew "container"
brew "anomalyco/tap/opencode" # CLI pour opencode.nvim (AI coding agent, GitHub Copilot, etc.)

# -----------------
# CLI Tools - Utilities
# -----------------
brew "btop"
brew "wget"
brew "trash"
brew "exiftool"
brew "jq"
brew "entr"

# -----------------
# Cloud & DevOps
# -----------------
brew "awscli"

# -----------------
# Scala/Java ecosystem
# -----------------
brew "coursier/formulas/coursier"

# -----------------
# Database
# -----------------
brew "postgresql@15"

# -----------------
# Fonts (Nerd Fonts)
# -----------------
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"

# -----------------
# Casks (GUI Apps)
# -----------------
cask "nikitabobko/tap/aerospace"
cask "ghostty"
cask "raycast"
cask "gcloud-cli"
cask "chromium"
cask "sf-symbols"
cask "bruno"
cask "cursor"
cask "notion"
#cask "visual-studio-code"
#cask "zen"

# -----------------
# Apps to install manually (not managed by brew)
# Uncomment on a fresh Mac if you want brew to install them
# -----------------
#cask "docker-desktop"
cask "slack"
cask "google-chrome"

# -----------------
# Optional
# -----------------
# cask "spotify"
# cask "discord"

# -----------------
# VSCode Extensions
# -----------------
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "joelcrosby.one-dark-darker"
vscode "kamikillerto.vscode-colorize"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "ms-playwright.playwright"
vscode "pabitrabanerjee.idx-dark-theme"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "simonsiefke.svg-preview"
vscode "steoates.autoimport"
vscode "stylelint.vscode-stylelint"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
